#include<iostream> //เป็นไดเร็กทิฟพรีโพรเซสเซอร์ที่แจ้งให้คอมไพเลอร์รวมiostreamไลบรารี ไว้
using namespace std; // ประกาศว่าจะใช้std

int main (){      //ฟั้งชันหลักของตัวcode
    int A = 0; //ประกาศว่าตัวแปรAจะเก็บค่าข้อมูลที่เป็นตัวเลข
    cout<<"Please enter a number to A: "<< endl; //ป้อนข้อมูลตัวเลข
    cin >> A;  //เก็บข้อมูลจากผู้ใช้

    if(A<5){    //เช็คเงื่อนไขว่าAน้อยกว่า5หรือไม่
        cout<<"Condition met"<<endl; //ถ้าเป็นจริงให้พิมพ์ข้อความนี้
    }
    
    return 0; //การย้อนกลับเป็น0
}