#include<iostream>   //เป็นไดเร็กทิฟพรีโพรเซสเซอร์ที่แจ้งให้คอมไพเลอร์รวมiostreamไลบรารี ไว้
using namespace std;  // ประกาศว่าจะใช้std

int main() {      //ฟั้งชันหลักของตัวcode
    int A = 0; //ประกาศว่าตัวแปรAจะเก็บค่าข้อมูลที่เป็นตัวเลข
    cout << "Please enter a number for A: " << endl;   //ป้อนข้อมูลตัวเลข
    cin >> A;     //เก็บข้อมูลจากผู้ใช้

    if (A == 8) {   //เช็คเงื่อนไขว่าA=8หรือไม่
        cout << "A is 8" << endl;  // ถ้าใช่พิมพ์Aคือ8
    } else if (A > 8) {    //เช็คว่าAมากว่า8หรอไม่
        cout << "A is greater than 8" << endl;   //ถ้าใช่พิมพ์ข้อความ
    } else {     //เช็คว่าเข้าเงื่อนไขทั้ง2ข้อไหม
        cout << "A is less than 8" << endl;  //ถ้าไม่เข้าเงื่อนไขทั้ง2ข้อให้พิมพ์ข้อความตามนี้
    }

    return 0;  //ไม่มีการย้อนกลัุบข้อมูล
}